БухЭксп/Documents/CW_СписаниеЗатратНаРеализацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_СписаниеЗатратНаРеализацию</Name>
			<BasedOn>
				<xr:Item>Document.CW_ДоходыПоГрузоперевозке</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_НезавершенноеПроизводство</xr:Item>
				<xr:Item>AccumulationRegister.CW_РасходыНаРеализацию</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриложениеКДоговору</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасходов</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокОтражения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыУчетаНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма_Валюта</Name>
							<Comment>"Сумма" в валюте договора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС_Валюта</Name>
							<Comment>"НДС" в валюте договора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего_Валюта</Name>
							<Comment>"Всего" в валюте договора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_НезавершенноеПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_НезавершенноеПроизводство</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>"Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Comment>"НДС" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма_Валюта</Name>
					<Comment>"Сумма" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС_Валюта</Name>
					<Comment>"НДС" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего_Валюта</Name>
					<Comment>"Всего" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокОтражения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособУчетаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговоруПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СоставГруппУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СоставГруппУслуг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Documents/CW_СписаниеЗатратНаРеализацию/Forms/ФормаПодбораЗатрат/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДатаСреза", 				ДатаСреза);
	Параметры.Свойство("Организация", 				Организация);
	Параметры.Свойство("ПодразделениеОрганизации",	ПодразделениеОрганизации);
	Параметры.Свойство("ДокументОснование", 		ДокументОснование);
	Параметры.Свойство("АдресПодобранныхДанных",	АдресПодобранныхДанных);
	
	
	ДатаСреза 			= ?(ДатаСреза = Дата(1,1,1), ТекущаяДата(), ДатаСреза);
	
	Контрагент 			= ДокументОснование.Контрагент;
	Договор 			= ДокументОснование.Договор;
	ПриложениеКДоговору = ДокументОснование.ПриложениеКДоговору;
	ПоказатьГруппуУслуг = Договор.ИспользуетсяОграниченияПоГруппамУслуг или  ПриложениеКДоговору.ИспользуетсяОграниченияПоГруппамУслуг;
	
	Элементы.ВходящиеУслугиГруппаУслуг.Видимость  = ПоказатьГруппуУслуг;
	Элементы.ИсходящиеУслугиГруппаУслуг.Видимость = ПоказатьГруппуУслуг;
	
	УстанавливаемыеПараметры = Новый Структура;
	УстанавливаемыеПараметры.Вставить("CW_ДоговорПоГрузоперевозкам", Договор);
	
	УстановитьПараметрыФункциональныхОпцийФормы(УстанавливаемыеПараметры);
	
	УстановитьПараметрыДинамическогоСписка();
	
	УстановитьИтоговуюСтроку();
	
	ЗаполнитьДеревоВходящихУслуг();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыДинамическогоСписка()
	
	ПорядокОтраженияДляНЗП  = CW_УчетНЗПСервер.ПолучитьПорядокОтраженияДляУчетаВСоставеНЗП();
	мПорядокОтражения		= ПорядокОтраженияДляНЗП["Доходы"];
	
	ИсходящиеУслуги.Параметры.УстановитьЗначениеПараметра("ДокументОснование", ДокументОснование);
	ИсходящиеУслуги.Параметры.УстановитьЗначениеПараметра("мПорядокОтражения", мПорядокОтражения);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьИтоговуюСтроку()
	
	СтруктураИтогов = CW_БухгалтерияЭкспедитораСерверПереопределяемый.ИтогиДинамическогоСписка(ИсходящиеУслуги,"Всего,НДС,Сумма");
	СтруктураИтогов.Сумма 	= ?(СтруктураИтогов.Сумма = Null,0,СтруктураИтогов.Сумма);
	СтруктураИтогов.НДС 	= ?(СтруктураИтогов.НДС = Null,0,СтруктураИтогов.НДС);
	СтруктураИтогов.Всего 	= ?(СтруктураИтогов.Всего = Null,0,СтруктураИтогов.Всего);
	
	Элементы.ИсходящиеУслугиИтоговаяСтрока.Заголовок = "Сумма: "+Формат(СтруктураИтогов.Сумма, "ЧДЦ=2; ЧН=0.00")	+ " " + Строка(ДокументОснование.Валюта)+ " " +
	                                                   "НДС: "+Формат(СтруктураИтогов.НДС, "ЧДЦ=2; ЧН=0.00")		+ " " + Строка(ДокументОснование.Валюта)+ " " +
	                                                   "Всего: "+Формат(СтруктураИтогов.Всего, "ЧДЦ=2; ЧН=0.00")	+ " " + Строка(ДокументОснование.Валюта);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоВходящихУслуг()
	
	Если ЭтоАдресВременногоХранилища(АдресПодобранныхДанных) Тогда
		ПодобранныеДанные =  ПолучитьИзВременногоХранилища(АдресПодобранныхДанных);
	КонецЕсли;
	
	Если ТипЗнч(ПодобранныеДанные) <> тип("ТаблицаЗначений") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 0
		               |	CW_СписаниеЗатратНаРеализациюЗатраты.ДокументРасходов КАК ДокументРасходов,
		               |	CW_СписаниеЗатратНаРеализациюЗатраты.Номенклатура КАК Номенклатура,
		               |	CW_СписаниеЗатратНаРеализациюЗатраты.Всего_Валюта КАК Всего_Валюта
		               |ИЗ
		               |	Документ.CW_СписаниеЗатратНаРеализацию.Затраты КАК CW_СписаниеЗатратНаРеализациюЗатраты";
		
		РезультатЗапроса = Запрос.Выполнить();
		ПодобранныеДанные = РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка КАК Грузоперевозка
	               |ИЗ
	               |	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
	               |ГДЕ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	РезультатЗапроса = Запрос.Выполнить();
	
	мГрузоперевозки = Новый Массив;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		мГрузоперевозки.Добавить(Выборка.Грузоперевозка);	
	КонецЦикла;
	
	//ВНИМАНИЕ! В ТЕКСТЕ ЗАПРОСА "//УсловиеКОРП"
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодобранныеДанные.ДокументРасходов КАК ДокументРасходов,
	               |	ПодобранныеДанные.Номенклатура КАК Номенклатура,
	               |	ПодобранныеДанные.Всего_Валюта КАК Всего_Валюта
	               |ПОМЕСТИТЬ ВТ_ДанныеДокумента
	               |ИЗ
	               |	&ПодобранныеДанные КАК ПодобранныеДанные
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_НезавершенноеПроизводствоОстатки.ДокументРасходов КАК ДокументРасходов,
	               |	CW_НезавершенноеПроизводствоОстатки.Контрагент КАК Контрагент,
	               |	CW_НезавершенноеПроизводствоОстатки.Валюта КАК Валюта,
	               |	CW_НезавершенноеПроизводствоОстатки.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(СоставГруппУслугПриложения.ГруппаУслуг, ЕСТЬNULL(СоставГруппУслугДоговора.ГруппаУслуг, НЕОПРЕДЕЛЕНО)) КАК ГруппаУслуг,
	               |	CW_НезавершенноеПроизводствоОстатки.Всего_ВалютаОстаток КАК Всего,
	               |	ЕСТЬNULL(ВТ_ДанныеДокумента.Всего_Валюта, 0) КАК Всего_Валюта
				   |ИЗ
				   |	РегистрНакопления.CW_НезавершенноеПроизводство.Остатки(
				   |			&ДатаСреза,
				   |			Грузоперевозка В (&мГрузоперевозки)
				   |				И Организация = &Организация
				   |				//УсловиеКОРП	         
				   |				И Покупатель = &Покупатель
				   |				И ДоговорПокупателя = &ДоговорПокупателя
				   |				И ПриложениеКДоговоруПокупателя = &ПриложениеКДоговору) КАК CW_НезавершенноеПроизводствоОстатки
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_СоставГруппУслуг КАК СоставГруппУслугДоговора
				   |		ПО CW_НезавершенноеПроизводствоОстатки.ДоговорПокупателя = СоставГруппУслугДоговора.Владелец
				   |			И CW_НезавершенноеПроизводствоОстатки.Номенклатура = СоставГруппУслугДоговора.Услуга
				   |			И (СоставГруппУслугДоговора.Владелец.ИспользуетсяОграниченияПоГруппамУслуг = ИСТИНА)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_СоставГруппУслуг КАК СоставГруппУслугПриложения
	               |		ПО CW_НезавершенноеПроизводствоОстатки.ПриложениеКДоговоруПокупателя = СоставГруппУслугПриложения.Владелец
	               |			И CW_НезавершенноеПроизводствоОстатки.Номенклатура = СоставГруппУслугПриложения.Услуга
	               |			И (CW_НезавершенноеПроизводствоОстатки.ПриложениеКДоговоруПокупателя.ИспользуетсяОграниченияПоГруппамУслуг = ИСТИНА)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |		ПО CW_НезавершенноеПроизводствоОстатки.ДокументРасходов = ВТ_ДанныеДокумента.ДокументРасходов
	               |			И CW_НезавершенноеПроизводствоОстатки.Номенклатура = ВТ_ДанныеДокумента.Номенклатура
	               |ИТОГИ
	               |	МАКСИМУМ(Контрагент),
	               |	МАКСИМУМ(Валюта),
	               |	СУММА(Всего),
	               |	СУММА(Всего_Валюта)
	               |ПО
	               |	ДокументРасходов";
	
	//Для версии КОРП  				   

	Если ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям") Тогда
		Запрос.Текст 				= СтрЗаменить(Запрос.Текст, "//УсловиеКОРП","И ПодразделениеОрганизации = &ПодразделениеОрганизации");
		Запрос.УстановитьПараметр("ПодразделениеОрганизации", ПодразделениеОрганизации);
	КонецЕсли;
	//Для версии КОРП
	
	Запрос.УстановитьПараметр("ДатаСреза", 				ДатаСреза);
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Покупатель",				Контрагент);
	Запрос.УстановитьПараметр("ДоговорПокупателя", 		Договор);
	Запрос.УстановитьПараметр("ПриложениеКДоговору",	ПриложениеКДоговору);
	Запрос.УстановитьПараметр("ПодобранныеДанные",		ПодобранныеДанные);
	Запрос.УстановитьПараметр("мГрузоперевозки",		мГрузоперевозки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДеревоЗатрат = РеквизитФормыВЗначение("ВходящиеУслуги");
	ДеревоЗатрат.Строки.Очистить();

	ВыборкаДокументы = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокументы.Следующий() Цикл
		
		ГруппаДерева = ДеревоЗатрат.Строки.Добавить();
		ГруппаДерева.НоменклатураПредставление 	= Строка(ВыборкаДокументы.Контрагент) + "("+ВыборкаДокументы.ДокументРасходов.ПредставлениеДокумента+")"+ " - "+Формат(ВыборкаДокументы.Всего, "ЧДЦ=2")+" "+Строка(ВыборкаДокументы.Валюта); 
		ГруппаДерева.ДокументРасходов          	= ВыборкаДокументы.ДокументРасходов;
		ГруппаДерева.Остаток                    = ВыборкаДокументы.Всего;
		ГруппаДерева.КСписанию                  = ВыборкаДокументы.Всего_Валюта;
		
		ВыборкаДетали = ВыборкаДокументы.Выбрать();
		Пока ВыборкаДетали.Следующий() Цикл
			
			СтрокаДерева = ГруппаДерева.Строки.Добавить();
			СтрокаДерева.НоменклатураПредставление 	= Строка(ВыборкаДетали.Номенклатура); 
			СтрокаДерева.Номенклатура              	= ВыборкаДетали.Номенклатура;
			СтрокаДерева.ГруппаУслуг				= ВыборкаДетали.ГруппаУслуг;
			СтрокаДерева.Остаток                    = ВыборкаДетали.Всего;
			СтрокаДерева.КСписанию                  = ВыборкаДетали.Всего_Валюта ;
			
			СтрокаДерева.ДокументРасходов          	= ВыборкаДокументы.ДокументРасходов;
		    СтрокаДерева.ИндексКартинки				= 1;
			СтрокаДерева.Пометка					= ?( ВыборкаДетали.Всего_Валюта <> 0, 1, 0);
			
		КонецЦикла;
		
	КонецЦикла;
	
	УстановитьПометкуСтрокиРодителейНаСервере(ДеревоЗатрат);

	ЗначениеВРеквизитФормы(ДеревоЗатрат, "ВходящиеУслуги");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПометкуСтрокиРодителейНаСервере(ДеревоЗатрат)
	
	Для Каждого Родитель из ДеревоЗатрат.Строки Цикл
		ПометкаСумма = 0;
		Для Каждого СтрокаДерева из Родитель.Строки Цикл
			ПометкаСумма = ПометкаСумма + СтрокаДерева.Пометка;
		КонецЦикла;
		
		Если ПометкаСумма = 0 Тогда
			Родитель.Пометка = 0;
		ИначеЕсли ПометкаСумма = Родитель.Строки.Количество() Тогда
			Родитель.Пометка = 1;
		Иначе
			Родитель.Пометка = 2;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
//Команды дерева

&НаКлиенте
Процедура ОбновитьДерево(Команда)
	
	ЗаполнитьДеревоВходящихУслуг();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОткрытьДокумент(Команда)
	
	ТекущиеДанные = Элементы.ВходящиеУслуги.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекущиеДанные.ИндексКартинки = 1 Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ключ", ТекущиеДанные.ДокументРасходов);
	
	ОткрытьФорму("Документ.CW_РасходыПоГрузоперевозке.ФормаОбъекта", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоСнятьВсе(Команда)
	
	ВыделенныеСтроки = Элементы.ВходящиеУслуги.ВыделенныеСтроки;
	Если ВыделенныеСтроки = Неопределено или ВыделенныеСтроки.Количество() = 1 Тогда	
		УстановитьПометкуСтрокДерева(0);
	Иначе
		УстановитьСнятьПометкиВыделенныхСтрокДерева(ВыделенныеСтроки, 0);
	КонецЕсли;
	ПересчитатьСуммыДерева();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУстановитьВсе(Команда)
	
	ВыделенныеСтроки = Элементы.ВходящиеУслуги.ВыделенныеСтроки;
	Если ВыделенныеСтроки = Неопределено или ВыделенныеСтроки.Количество() = 1 Тогда	
		УстановитьПометкуСтрокДерева(1);
	Иначе
		УстановитьСнятьПометкиВыделенныхСтрокДерева(ВыделенныеСтроки, 1);
	КонецЕсли;
	ПересчитатьСуммыДерева();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуСтрокДерева(Пометка)
	
	СтрокиДерева = ВходящиеУслуги.ПолучитьЭлементы();
	УстановитьПометкуСтрокДереваПродоложить(СтрокиДерева, Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуСтрокДереваПродоложить(СтрокиДерева, Пометка)
	
	Для Каждого СтрокаДерева из СтрокиДерева Цикл
		СтрокаДерева.Пометка = Пометка;
		Если СтрокаДерева.ИндексКартинки = 0 Тогда
			Детали = СтрокаДерева.ПолучитьЭлементы();
			УстановитьПометкуСтрокДереваПродоложить(Детали, Пометка);
		Иначе
			СтрокаДерева.КСписанию = ?(Пометка = 1, СтрокаДерева.Остаток, 0);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьПометкиВыделенныхСтрокДерева(ВыделенныеСтроки, Пометка)
	
	Для каждого ВыделеннаяСтрока из ВыделенныеСтроки Цикл
		
		СтрокаДерева = ВходящиеУслуги.НайтиПоИдентификатору(ВыделеннаяСтрока);
		СтрокаДерева.Пометка = Пометка;
		
		Если СтрокаДерева.ИндексКартинки = 0 Тогда //Группа
			СтрокиДерева = СтрокаДерева.ПолучитьЭлементы();
			УстановитьПометкуСтрокДереваПродоложить(СтрокиДерева, СтрокаДерева.Пометка);
		Иначе
			СтрокаДерева.КСписанию = ?(Пометка = 1, СтрокаДерева.Остаток, 0);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВходящиеУслугиПометкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ВходящиеУслуги.ТекущаяСтрока;
	ВходящиеУслугиПометкаПриИзмененииПродолжить(ТекущаяСтрока);
	ВходящиеУслугиПересчитатьСуммыПоРодителю(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящиеУслугиПометкаПриИзмененииПродолжить(ТекущаяСтрока)
	
	СтрокаДерева = ВходящиеУслуги.НайтиПоИдентификатору(ТекущаяСтрока);
	СтрокаДерева.Пометка =  ?(СтрокаДерева.Пометка = 2, 0, СтрокаДерева.Пометка);
	
	Если СтрокаДерева.ИндексКартинки = 0 Тогда //Группа
		СтрокиДерева = СтрокаДерева.ПолучитьЭлементы();
		УстановитьПометкуСтрокДереваПродоложить(СтрокиДерева, СтрокаДерева.Пометка);
	Иначе
		СтрокаДерева.КСписанию = ?(СтрокаДерева.Пометка = 1, СтрокаДерева.Остаток, 0);
		Родитель = СтрокаДерева.ПолучитьРодителя();
		УстановитьПометкуРодителя(Родитель);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуРодителя(Родитель)
	
	СтрокиРодителя 	= Родитель.ПолучитьЭлементы();
	
	ПометкаСумма = 0;
	Для Каждого СтрокаРодителя из СтрокиРодителя Цикл
		ПометкаСумма = ПометкаСумма + СтрокаРодителя.Пометка;
	КонецЦикла;
	
	Если ПометкаСумма = 0 Тогда
		Родитель.Пометка = 0;
	ИначеЕсли ПометкаСумма = СтрокиРодителя.Количество() Тогда
		Родитель.Пометка = 1;
	Иначе
		Родитель.Пометка = 2;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящиеУслугиПересчитатьСуммыПоРодителю(ТекущаяСтрока)
	
	СтрокаДерева = ВходящиеУслуги.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Если СтрокаДерева.ИндексКартинки = 0 Тогда //Группа
		ПересчитатьСтрокиПоРодителю(СтрокаДерева);
	Иначе
		Родитель = СтрокаДерева.ПолучитьРодителя();
		ПересчитатьСтрокиПоРодителю(Родитель);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммыДерева()

	СтрокиДерева = ВходящиеУслуги.ПолучитьЭлементы();
	Для Каждого Родитель из СтрокиДерева Цикл
		ПересчитатьСтрокиПоРодителю(Родитель);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокиПоРодителю(Родитель)
	
	Родитель.Остаток 	= 0; 
	Родитель.КСписанию 	= 0;
	СтрокиРодитель = Родитель.ПолучитьЭлементы();
	
	Для Каждого СтрокаДерева из СтрокиРодитель Цикл
		Родитель.Остаток 	= Родитель.Остаток + СтрокаДерева.Остаток; 
		Родитель.КСписанию 	= Родитель.КСписанию + СтрокаДерева.КСписанию; 
	КонецЦикла;

КонецПроцедуры
//Команды дерева

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	АдресОтмеченныхСтрок = ПолучитьОтмеченныеДанные();
	ЭтаФорма.Закрыть(АдресОтмеченныхСтрок);
КонецПроцедуры

&НаСервере
Функция ПолучитьОтмеченныеДанные()
	
	ДеревоФормы = РеквизитФормыВЗначение("ВходящиеУслуги");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 0
	|	CW_СписаниеЗатратНаРеализациюЗатраты.ДокументРасходов КАК ДокументРасходов,
	|	CW_СписаниеЗатратНаРеализациюЗатраты.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.CW_СписаниеЗатратНаРеализацию.Затраты КАК CW_СписаниеЗатратНаРеализациюЗатраты";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаВыбранныхСтрок = РезультатЗапроса.Выгрузить();

	Отбор = Новый Структура;
	Отбор.Вставить("Пометка", 			1);
	Отбор.Вставить("ИндексКартинки", 	1);
	
	мВыбранныеСтроки = ДеревоФормы.Строки.НайтиСтроки(Отбор, Истина);
	
	Для Каждого ВыбраннаяСтрока из мВыбранныеСтроки ЦИкл
		НоваяСтрока = ТаблицаВыбранныхСтрок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыбраннаяСтрока);
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаВыбранныхСтрок, новый УникальныйИдентификатор);
	
КонецФункции
